# Taps
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'shivammathur/php'
tap 'shivammathur/extensions'
tap 'minio/stable'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'htop'

# Development
brew 'php'
brew 'php@7.4'
brew 'php@7.3'
brew 'php@7.2'
brew 'shivammathur/php/php@7.1'
brew 'composer'
brew 'meilisearch'
brew 'mysql@5.7'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'mailhog'
brew 'minio/stable/minio'
brew 'zsh-syntax-highlighting'

# Apps
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'firefox-developer-edition'
cask 'github'
cask 'google-chrome'
cask 'imageoptim'
cask 'postman'
cask 'phpmon'
cask 'jetbrains-toolbox'
cask 'signal'
cask 'tableplus'
cask 'tinkerwell'
cask 'tunnelblick'
cask 'visual-studio-code'
cask 'zoom'
cask 'microsoft-teams'
cask 'omnidisksweeper'
cask 'aerial'
cask 'appcleaner'
cask 'onyx'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'webpquicklook'

# Fonts
cask 'font-jetbrains-mono'

# Mac App Store
mas 'AdGuard for Safari', id: 1440147259
mas 'Pages', id: 409201541
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Codeshot', id: 1541665460
mas 'DevCleaner', id: 1388020431
mas 'Icon Set Creator', id: 939343785
mas 'Magnet', id: 441258766
mas 'The Unarchiver', id: 425424353
