# Taps
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'shivammathur/php'
tap 'shivammathur/extensions'
tap 'minio/stable'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'htop'
brew 'tree'

# Development
brew 'php'
brew 'composer'
brew 'meilisearch'
brew 'mysql@5.7'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'mailhog'
brew 'mailpit'
brew 'minio/stable/minio'
brew 'zsh-syntax-highlighting'
brew 'symfony-cli/tap/symfony-cli'
brew 'pv'

# Apps
cask 'cyberduck'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'flux'
cask 'firefox-developer-edition'
cask 'github'
cask 'google-chrome'
cask 'hyper'
cask 'imageoptim'
cask 'notion'
cask 'postman'
cask 'phpmon'
cask 'jetbrains-toolbox'
cask 'tower'
cask 'tableplus'
cask 'tunnelblick'
cask 'tinkerwell'
cask 'visual-studio-code'
cask 'zoom'
cask 'slack'
cask 'microsoft-teams'
cask 'omnidisksweeper'
cask 'appcleaner'
cask 'onyx'
cask 'krisp'

# Fonts
cask 'font-jetbrains-mono'

# Mac App Store
mas 'The Unarchiver', id: 425424353
mas 'Hidden Bar', id: 1452453066
